Documents/сок_ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>сок_ЗаявкаНаРасходованиеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.сок_ГрафикПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.сок_Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНазначенияПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сок_КодыНазначенияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сок_СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сок_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сок_ВидЗаявкиАвансКредит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВБитФинанс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификторПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПП</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виза</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСогласования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сок_СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сок_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HTTPServices/ОбменБФ/Ext/Module.bsl
Функция ПингGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки("ok");
	
	Возврат Ответ;
КонецФункции


Процедура ЗафиксироватьДанныеОбОплате(Структ,Рез)
	
 	//"Команда,ИДЗаявки,ИдПлатежногоПоручения,СуммаДокумент,ДатаПП,НомерПП,Проведен",

	СсылкаНаЗаявку=Документы.сок_ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.ИДЗаявки));
	Элемент = СсылкаНаЗаявку.ПолучитьОбъект();
	Если Элемент=Неопределено Тогда
		Рез.ТелоОтвета = "Не обнаружена заявка на расходование денежных средств с идентифкаторм "+Структ.ИДЗаявки;
		Возврат;
	Иначе
		Стр=Элемент.Оплаты.Найти(Структ.ИдПлатежногоПоручения,"ИдентификторПП");
		Если Стр=Неопределено Тогда
			Если НЕ Структ.Проведен Тогда
				Рез.Ок=Истина;
				Возврат;
			КонецЕсли;	
			Стр=Элемент.Оплаты.Добавить(); 
			Стр.ИдентификторПП=Структ.ИдПлатежногоПоручения;
		Иначе	
			Если Стр.Сумма=Структ.СуммаДокумента И Стр.НомерПП=Структ.НомерПП И НачалоДня(Стр.ДатаПП)=НачалоДня(Структ.ДатаПП) Тогда
				Рез.Ок=Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		Стр.Сумма=Структ.СуммаДокумента;
		Стр.НомерПП=Структ.НомерПП;
		Стр.ДатаПП=НачалоДня(Структ.ДатаПП);
		Если НЕ Структ.Проведен Тогда
			Элемент.Оплаты.Удалить(Элемент.Оплаты.Индекс(Стр));
		КонецЕсли;	
		Попытка
			Элемент.Записать(РежимЗаписиДокумента.Проведение);
			Рез.Ок=Истина;
		Исключение
			Рез.ТелоОтвета = "Не удалось записать в Аптеке документ "+Элемент.Ссылка;
		Конецпопытки;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ИзменитьСтатусЗаявки(ДанныеИзБитФинанс,Рез)
	СсылкаНаЗаявку=Документы.сок_ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеИзБитФинанс.ИДЗаявки));
	Элемент = СсылкаНаЗаявку.ПолучитьОбъект();
	Если Элемент=Неопределено Тогда
		Рез.ТелоОтвета = "Не обнаружена заявка на расходование денежных средств с идентифкаторм "+ДанныеИзБитФинанс.ИДЗаявки;
		Возврат;
	Иначе
		Элемент.СостояниеЗаявки=ДанныеИзБитФинанс.СтатусЗаявки;
		Элемент.ОбменДанными.Загрузка=Истина;
		Если НЕ Элемент.Отправлена Тогда
			Элемент.НомерВБитФинанс=ДанныеИзБитФинанс.Номер;
			Элемент.Отправлена=Истина;
			Элемент.ДатаОтправки=ТекущаяДата();
		КонецЕсли;	
		Попытка
		       Элемент.Записать();
			   Рез.ТелоОтвета = "Ок. Статус изменен на "+Элемент.СостояниеЗаявки;
		  Исключение
		  Рез.ТелоОтвета = "Не удалось записать заявку при изменении статуса заявки "+СсылкаНаЗаявку+" "+ОписаниеОшибки();;
			   
		КонецПопытки;	   
	КонецЕсли;
КонецПроцедуры	

Функция ОбменPOST(Запрос)
	
	Структ = ЗначениеИзСтрокиВнутр(Запрос.ПолучитьТелоКакСтроку());
	Рез=Новый Структура("Ок,Ид,ТелоОтвета",Ложь,"","");
	Если ТипЗнч(Структ)=Тип("Массив") Тогда
		Масс=Структ;
	Иначе
		Масс=Новый Массив;
		Масс.Добавить(Структ);
	КонецЕсли;	
	Для Каждого Структ из Масс Цикл
		Если Структ.Команда="ПроведениеСписаниеСРасчетногоСчета" Тогда
			ЗафиксироватьДанныеОбОплате(Структ,Рез);
		ИначеЕсли Структ.Команда="ИзменениеСтатусаЗаявки" Тогда	
			ИзменитьСтатусЗаявки(Структ,Рез);
		КонецЕсли;
	КонецЦикла;
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗначениеВстрокуВнутр(Рез));
	Возврат Ответ;
	
КонецФункции

Функция ОбменGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки("Привет из Аптеки");
	Возврат Ответ;
	
КонецФункции
